Revit 2027 API
BuiltInFailures.StairRampFailures.WinderTooManyParallelTreadsAtHeadFailure Property
 The number of parallel treads at start is too great.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WinderTooManyParallelTreadsAtHeadFailure { get; }
Public Shared ReadOnly Property WinderTooManyParallelTreadsAtHeadFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WinderTooManyParallelTreadsAtHeadFailure {
	FailureDefinitionId^ get ();
}
static member WinderTooManyParallelTreadsAtHeadFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace